Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: The following example uses the operator form of C<readline> and dies if the result is not defined.
es_es: En el ejemplo siguiente se utiliza la forma del operador de C<readline> y muere si el resultado no está definido.

source: The assignment to C<$^R> above is properly localized, so the old value of C<$^R> is restored if the assertion is backtracked; compare L<"Backtracking">.
es_es: La asignación a C<$^R> anterior está apropiadamente localizada, por lo que el valor anterior de C<$^R> es restaurado si la aserción es retrotraída; ver L<"Retrotraer">.

source: Note that the C<a>, C<d>, C<l>, C<p>, and C<u> modifiers are special in that they can only be enabled, not disabled, and the C<a>, C<d>, C<l>, and C<u> modifiers are mutually exclusive: specifying one de-specifies the others, and a maximum of one (or two C<a>'s) may appear in the construct.
es_es: Note que los modificadores C<a>, C<d>, C<l>, C<p>, y C<u> son especiales, en el sentido en que solo pueden ser activados, no desactivados, y los modificadores C<a>, C<d>, C<l>, y C<u> son mutuamente excluyentes: especificando uno de ellos de-especifica a los otros, y un máximo de uno (o dos C<a>) pueden aparecer en la construcción.

source: The C source code and header files mostly live in the root of the source tree.
es_es: La mayor parte del código C y los archivos de encabezado se encuentran en el directorio raíz del árbol de código fuente.

source: The handling of authors' names that had apostrophes has been fixed.
es_es: El manejo de los nombres de los autores que tenían apóstrofes se ha solucionado.

source: Break out of a C<given()> block.
es_es: Sale de un bloque C<given()>.

source: P A pointer to a structure (fixed-length string).
es_es: P Un puntero a una estructura (una cadena de longitud fija).

source: In much better shape than it used to be.
es_es: En una forma mucho mejor de lo que solía ser.

source: A negative OFFSET specifies placement at that many characters counting backwards from the end of the string.
es_es: Un DESPLAZAMIENTO negativo especifica el desplazamiento en número de caracteres contando desde el final de la cadena.

source: The null filehandle <> is special: it can be used to emulate the behavior of B<sed> and B<awk>.
es_es: El identificador de archivo nulo <> es especial: puede ser utilizado para emular el comportamiento de B<sed> y B<awk>.

source: In perl 5.12.x and earlier, because the regex engine was not re-entrant, delayed code could not safely invoke the regex engine either directly with C<m//> or C<s///>), or indirectly with functions such as C<split>.
es_es: En perl 5.12.x y anteriores, debido a que el motor regex es, actualmente, no re-entrante, el código interpolado no podrá invocar de forma segura el motor regex, tanto directamente con C<m//> o C<s///>, o indirectamente con funciones, como C<split>.

source: :-) If I were you, I'd put that in a function:
es_es: :-) Si yo fuera usted, lo pondría en una función:

source: If some particular order is really important, use tied hashes: for example the Tie::IxHash module which by default preserves the order in which the hash elements were added.
es_es: Si un determinado orden es muy importante, utilice hashes enlazados: por ejemplo, el módulo Tie::IxHash, que por defecto preserva el orden en que los elementos de un hash han sido añadidos.

source: Since C<system> does a C<fork> and C<wait> it may affect a C<SIGCHLD> handler.
es_es: Debido a que C<system> hace un C<fork> y un C<wait> puede afectar al controlador C<SIGCHLD>.

source: Following a C<< << >> you specify a string to terminate the quoted material, and all lines following the current line down to the terminating string are the value of the item.
es_es: Siguiendo a C<< << >> especifica una cadena que termine el material entrecomillado, y todas las líneas siguientes a la actual hacia abajo hasta la cadena de terminación, son el valor del elemento.

source: Perl is being ported to Symbian OS.
es_es: Perl ha sido portado a Symbian OS.

source: You can't call a class method or an ordinary function on a class that has been collected that way.
es_es: No puede llamar a un método de clase o a una función ordinaria en una clase que se haya destruido de esa manera.

source: That's because there are so many different ways to split a long string into several substrings.
es_es: Eso es porque hay tantas maneras diferentes de dividir una larga cadena en varias subcadenas.

source: (?=(b)) # zero-width assertion
es_es: (?=(b)) # aserción de ancho cero

source: =item pipe READHANDLE,WRITEHANDLE X<pipe>
es_es: =item pipe CONTROLADOR_LECTURA,CONTROLADOR_ESCRITURA X<pipe> X<tubería>

source: Read all about it (and other special variables) in L<perlvar>.
es_es: Encontrará información sobre este hash (y sobre otras variables especiales) en L<perlvar>.

source: WinCE: integrate the port
es_es: WinCE: integrar su versión

source: One level of double-quote interpretation is done first, but you can't say C<< <$foo> >> because that's an indirect filehandle as explained in the previous paragraph.
es_es: Se hace en primer lugar una interpretación por comilla doble, pero no puede escribir C<< <$foo> >> porque eso es un identificador de archivo indirecto, como se ha explicado en el párrafo anterior.

source: LABEL until (EXPR) BLOCK
es_es: ETIQUETA until (EXPR) BLOQUE

source: See L<re/"'/flags' mode">.
es_es: Vea L<re/"modo '/banderas'">.

source: Note that C<sysopen> depends on the fdopen() C library function.
es_es: Tenga en cuenta que C<sysopen> depende de la función de biblioteca C fdopen().

source: If you don't really want to execute the first argument, but want to lie to the program you are executing about its own name, you can specify the program you actually want to run as an "indirect object" (without a comma) in front of the LIST.
es_es: Si realmente no quiere ejecutar el primer argumento, pero quiere engañar al programa que está ejecutando sobre su propio nombre, puede especificar el programa que quiera ejecutar como un "objeto indirecto" (sin la coma) enfrente de la LISTA.

source: For integer conversions, specifying a precision implies that the output of the number itself should be zero-padded to this width, where the 0 flag is ignored:
es_es: Para las conversiones de entero, especificando una precisión implica que la salida del número en sí mismo debería ser rellenado con ceros a este ancho, donde se pasa por alto a la bandera 0:

source: Note that the use of these six specific operators to verify if some operation is possible is usually a mistake, because it may be open to race conditions.
es_es: Note que el uso de seis operadores específicos para verificar si cierta operación es posible, es usualmente una equivocación, porque puede ser el inicio de bloqueos de carrera.

source: A comment.
es_es: Un comentario.

source: If used in list context, returns all the rest of the entries in the directory.
es_es: Si se usa en contexto de lista, devuelve el resto de las entradas en el directorio.

source: =item bless REF,CLASSNAME X<bless>
es_es: =item bless REF,NOMBRECLASE X<bless>

source: These buckets will be retained even if you do C<%hash = ()>, use C<undef %hash> if you want to free the storage while C<%hash> is still in scope.
es_es: Estos alojamientos serán mantenidos incluso si hace C<%hash = ()>. Use C<undef %hash> si quiere liberar el almacenamiento mientras mantiene a C<%hash> en el ámbito.

source: Implements C<dl_unload_file> on Win32
es_es: Implementa C<dl_unload_file> en Win32

source: The C<UNIVERSAL> class has a new method, C<DOES()>.
es_es: La clase C<UNIVERSAL> tiene un nuevo método, C<DOES()>.

source: As mentioned earlier, Perl can store a number in any one of three formats, but most operators typically understand only one of those formats.
es_es: Como se mencionó antes, Perl puede almacenar un número en uno de tres formatos distintos, pero la mayoría de los operadores suelen admitir solo uno de esos formatos.

source: The table of smart matches is not identical to that proposed by the Perl 6 specification, mainly due to the differences between Perl 6's and Perl 5's data models.
es_es: La tabla de coincidencias inteligentes no es idéntica a la propuesta por la especificación Perl 6, principalmente debido a las diferencias entre los modelos de datos entre Perl 6 y Perl 5.

source: \ Quote the next metacharacter
es_es: \ Escapa al siguiente metacarácter

source: =item no MODULE VERSION LIST X<no declarations> X<unimporting>
es_es: =item no MÓDULO VERSIÓN LISTA X<no declarations> X<unimporting> X<declaraciones no> X<desimportando>

source: If you want to print the whole thing, though, you can't say
es_es: Si desea imprimir toda el conjunto, sin embargo, no se puede decir

source: Embedded newlines will not be matched by "^" or "$".
es_es: Los caracteres de nueva línea incrustados dentro de la cadena no coincidirán con "^" o "$".

source: printf '<%-10.6d>', 1; # prints "<000001 >"
es_es: printf '<%-10.6d>', 1; # imprime "<000001 >"

source: One or more modifiers below may optionally follow certain letters in the TEMPLATE (the second column lists letters for which the modifier is valid):
es_es: Uno o más de los modificadores siguientes pueden, opcionalmente, seguir a ciertas letras en la PLANTILLA (la segunda columna enumeran las letras para las cuales el modificador es válido):

source: For future releases our goal is to make PerlIO go even faster.
es_es: Para futuras versiones nuestro objetivo es hacer que PerlIO vaya aún más rápido.

source: Here is what C has that Perl doesn't:
es_es: Esto es lo que C tiene que Perl no:

source: =head2 Tied hashes in scalar context
es_es: =head2 Hashes enlazados en contexto escalar

source: The C<:unique> attribute has been made a no-op, since its current implementation was fundamentally flawed and not threadsafe.
es_es: El atributo C<:unique> se ha convertido en una no-operación, debido a que su implementación era, fundamentalmente, defectuosa y no multi-hilo.

source: While this is useful and supported, it can cause bizarre results if the elements of LIST are not variables.
es_es: Mientras que esto suele ser útil, puede causar resultados extraños si los elementos de la LISTA no son variables.

source: Use C<local> to localize changes to them to a specific scope if necessary.
es_es: Use C<local> para fijar cambios en ellas en un determinado ámbito, si fuera necesario.

# print "This element is $_ ";
source: print "This element is $_\n";
es_es: print "Este elemento es $_\n";

source: GNU make for VM/ESA, which may be required for the build of perl, is available from:
es_es: GNU make para VM/ESA, que puede ser requerido para la compilación de perl, está disponible desde:

source: {n,} Match at least n times
es_es: {n,} Coincide al menos n veces

source: Because a failed C<m//gc> match doesn't reset the offset, the return from C<pos> won't change either in this case.
es_es: Debido a que una coincidencia C<m//gc> fallida no reinicia el desplazamiento, el retorno de C<pos> no cambiará en ningún caso.

source: Now network socket support should remain enabled on BONE systems.
es_es: Ahora, el soporte para red debe permanecer habilitado en los sistemas BONE.

source: 4-column indent.
es_es: Sangrado a 4 columnas.

source: while ( condition ) {
es_es: while ( condición ) {

source: This calls the select(2) syscall with the bit masks specified, which can be constructed using C<fileno> and C<vec>, along these lines:
es_es: Esto llama a la función del sistema select(2) con las máscaras de bits especificadas, que pueden ser construidas usando C<fileno> y C<vec>, como muestran estas líneas:

source: Any Num numeric equality $a == $b
es_es: Cualquiera Número igualdad numérica $a == $b

source: Returns true if the context of the currently executing subroutine or C<eval> is looking for a list value.
es_es: Devuelve verdadero si el contexto de ejecución de la subrutina actual o C<eval> está buscando por una lista de valores.

source: But it's better just to put the C<1;>, in case you add more statements.
es_es: Pero es mejor sólo para poner C<1;>, en caso de que añada más instrucciones.

source: Before C<require> looks for a "F<.pm>" extension, it will first look for a similar filename with a "F<.pmc>" extension.
es_es: Antes de C<require> busque una extensión "F<.pm>", en primer lugar, buscará un nombre de archivo similar con una extensión "F<.pmc>".

source: For example, C<\w> will match the "word" characters of that locale, and C<"/i"> case-insensitive matching will match according to the locale's case folding rules.
es_es: Por ejemplo, C<\w> coincidirá con los caracteres "palabra" de esa localidad, y la insensibilidad al tamaño de caja C<"/i"> coincidirá de acuerdo a las normas regionales de plegado de caja.

source: =item map EXPR,LIST
es_es: =item map EXPR,LISTA

source: The C<my> is actually not required; you could just use:
es_es: En realidad no es obligatorio usar C<my>; se puede usar simplemente:

source: Thus C<$+{NAME_PAT}> would not be defined even though C<$+{NAME}> would be.
es_es: Así C<$+{NOMBRE_PAT}> no será definido a pesar de que C<$+{NOMBRE}> sí lo será.

source: If you read this file _as_is_, just ignore the equal signs on the left.
es_es: Si lee este archivo _tal_como_es_, ignore los caracteres extraños que vea.

source: During compilation you will see this warning from toke.c:
es_es: Durante la compilación, verá esta advertencia de toke.c:

source: The Perl motto is "There's more than one way to do it." Divining how many more is left as an exercise to the reader.
es_es: El lema de Perl es "Se puede hacer de varias maneras". Dejamos como ejercicio para el lector averiguar de cuántas maneras se puede hacer :-).

source: C<$yday> is the day of the year, in the range C<0..364> (or C<0..365> in leap years.)
es_es: C<$ydia> es el día del año, en el rango C<0..364> (o C<0..365> en los años bisiestos).

source: The ARG must consist of a vector of native short integers, which may be created with C<pack("s!",(0)x$nsem)>.
es_es: El ARG debe consistir en un vector de enteros cortos nativos, que pueden ser creados con C<pack("s!",(0)x$nsem)>.

source: C<$hasargs> is true if a new instance of C<@_> was set up for the frame.
es_es: C<$hasargs> es verdadero si una nueva instancia de C<@_> fue creada para este marco.

source: =head2 Building 64-bit Perl in Irix
es_es: =head2 Compilando Perl de 64 bit en Irix

source: It comes with a bundled version of zlib, so having a working zlib is not a prerequisite to install it.
es_es: Viene con una versión integrada de zlib, así que tener un zlib funcional no es un requisito previo para instalarlo.

source: UNSHIFT this, LIST
es_es: UNSHIFT este, LISTA

source: =item sleep EXPR X<sleep> X<pause>
es_es: =item sleep EXPR X<sleep> X<pause> X<pausa>

source: The position after the last match can be read or set using the C<pos()> function; see L<perlfunc/pos>.
es_es: La posición después de la última coincidencia puede ser leída o establecida mediante la función C<pos()>; vea L<perlfunc/pos>.

source: printf '<%.2g>', 100.01; # prints "<1e+02>"
es_es: printf '<%.2g>', 100.01; # imprime "<1e+02>"

source: Similarly, C<(?:...)> can't have a space between the C<?> and C<:>, but can between the C<(> and C<?>.
es_es: Del mismo modo, C<(?:...)> no puede tener ningún espacio entre C<?> y C<:>, pero puede tenerlos entre C<(> y C<?>.

source: @ARGV = @files;
es_es: @ARGV = @archivos;

source: Attempts to write LENGTH bytes of data from variable SCALAR to the specified FILEHANDLE, using write(2).
es_es: Intenta escribir LONGITUD bytes de datos desde la variable ESCALAR al IDENTIFICADOR_ARCHIVO especificado, utilizando write(2).

source: $foo = $bar =~ s/this/that/r =~ s/that/the other/r; # Chained substitutes using /r
es_es: $foo = $bar =~ s/este/aquel/r =~ s/ese/el otro/r; # Sustituciones encadenadas usando /r

source: Source code distributions have an automated "make install" step that means you do not need to extract the source code below /usr/local (though that is where it will be installed by default).
es_es: Las distribuciones de código fuente tiene un sistema automatizado de "make install" que significa que no es necesario extraer el código fuente en /usr/local (que es, sin embargo, donde se instala por defecto).

source: This was fixed by Nicholas Clark.
es_es: Esto fue corregido por Nicholas Clark.

source: ... # code for each line
es_es: ... # código por cada línea

source: That's no longer true.
es_es: Que ya no es cierto.

source: The usual idiom is:
es_es: El modismo habitual es:

source: See L<perlform> for many details and examples.
es_es: Ver L<perlform> para más detalles y ejemplos.

source: An optional feature, C<:hireswallclock>, now allows for high resolution wall clock times (uses Time::HiRes).
es_es: Una característica opcional, C<hireswallclock>, permite ahora tiempos de alta resolución de reloj (utiliza Time::HiRes).

source: A WHENCE of C<1> (C<SEEK_CUR>) is useful for not moving the file position:
es_es: Un DONDE de C<1> (C<SEEK_CUR>) es útil para no mover la posición del archivo:

source: $_ = "Food is on the foo table.";
es_es: $_ = "En el Comedor Principal el niño come espinacas.";

source: Perl continues to flourish into its third decade thanks to a vibrant community of users and developers.
es_es: Perl sigue floreciendo en su tercera década gracias a una vibrante comunidad de usuarios y desarrolladores.

source: tests whether the bitwise AND of $x and $y is zero, you will like this warning.
es_es: comprueba si el enmascaramiento AND de $x e $y son cero, le gustará esta advertencia.

source: Note that "|" and "^" have lower priority than relational operators, so for example the brackets are essential in a test like
es_es: Tenga en cuenta que "|" y "^" tienen menor prioridad que los operadores relacionales, así que, por ejemplo, los paréntesis son esenciales en una prueba como

source: Following the normal C<Configure>, you have to run make as follows:
es_es: Siguiendo el tradicional C<Configure>, tiene que ejecutar make de la siguiente manera:

source: =item Simple substitution
es_es: =item Sustitución simple

source: =item grep EXPR,LIST
es_es: =item grep EXPR,LISTA

source: First, let's look at reading it in from a file.
es_es: En primer lugar, echemos un vistazo a la lectura desde un archivo.

source: Returns a string formatted by the usual C<printf> conventions of the C library function C<sprintf>.
es_es: Devuelve una cadena formateada por los habituales convenios de C<printf> de la función de biblioteca C<sprintf>.

source: anything else that number
es_es: otra cosa ese número

source: Encode and output
es_es: Codificar y emitir los resultados

source: Binary "," is the comma operator.
es_es: Binario "," es el operador coma.

source: =item /PATTERN/msixpodualgc
es_es: =item /PATRÓN/msixpodualgc

source: printf '%*4$vX %*4$vX %*4$vX', @addr[1..3], ":"; # 3 IPv6 addresses
es_es: printf '%*4$vX %*4$vX %*4$vX', @addr[1..3], ":"; # 3 direcciones IPv6

source: The correct answer is either one of these:
es_es: La respuesta correcta es una de estas:

source: You have to use C<sysread> instead.
es_es: Tiene que usar en su lugar C<sysread>.

source: A C<*> for the repeat count uses all characters of the input field.
es_es: Un C<*> como contador de repetición utiliza todos los caracteres del campo de entrada.

source: Run C<perl Porting/Maintainers -M Module::Name> to find out more information about a dual-life module.
es_es: Ejecute C<perl Porting/Maintainers -M Nombre::Módulo> para obtener más información sobre un módulo de evolución dual.

source: If umask(2) is not implemented on your system and you are trying to restrict access for I<yourself> (i.e., C<< (EXPR & 0700) > 0 >>), raises an exception.
es_es: Si umask(2) no está implementada en su sistema y está tratando de restringir el acceso por I<sí mismo> (es decir, C<< (EXPR & 0700) > 0 >>), se lanza una excepción.

source: Takis Psarogiannakopoulos University of Cambridge Centre for Mathematical Sciences Department of Pure Mathematics Wilberforce road Cambridge CB3 0WB , UK email <takis@XFree86.Org>
es_es: Takis Psarogiannakopoulos Universidad de Cambridge Centro para las Ciencias Matemáticas Departamento de Matemáticas Puras Wilberforce road Cambridge CB3 0WB , UK email <takis@XFree86.Org>

source: Compilation errors will tell you the line number of the error, with an indication of the next token or token type that was to be examined.
es_es: Los errores de compilación le indicarán el número de línea del error, además del siguiente símbolo o tipo de símbolo que iba a ser examinado.

source: Improved compatibility with older versions of perl
es_es: Mejorada la compatibilidad con versiones anteriores de perl

source: (Case 4 is preferred for purely visual reasons, but it also has the advantage of compiling at compile-time instead of at run-time.) Case 5 is a place where normally you I<would> like to use double quotes, except that in this particular situation, you can just use symbolic references instead, as in case 6.
es_es: (El caso 4 es el preferido por razones puramente visuales, pero también tiene la ventaja de la compilación en tiempo de compilación en lugar de en tiempo de ejecución). Caso 5 es aquel donde normalmente I<debería> usar dobles comillas, excepto que en esta situación en particular, puede usar en su lugar referencias simbólicas instead, como en el caso 6.

source: The piping implementation now uses local rather than global DCL symbols for inter-process communication.
es_es: La implementación de tuberías ahora utiliza más locales que símbolos DCL globales para la comunicación entre procesos.

source: If VARIABLE is omitted, it chomps C<$_>.
es_es: Si VARIABLE se omite, usa C<$_>.

source: Later operations that treat $VERSION as a number will then be able to do so without provoking a warning about $VERSION not being a number.
es_es: Operaciones ulteriores que traten con $VERSION como un número, podrán hacerlo sin provocar una advertencia sobre si $VERSION no es un número.

source: Returns a Perl value which may be used instead of the corresponding C</STRING/msixpodual> expression.
es_es: Devuelve un valor de Perl que puede utilizarse en lugar de la correspondiente expresión C</CADENA/msixpodual>.

source: Extension modules can also hook into the Perl parser to define new kinds of keyword-headed expression.
es_es: Hay módulos con expansiones que también pueden engancharse en el intérprete Perl para definir nuevas clases de expresiones basadas en palabras clave.

source: The variable C<$,> may now be tied.
es_es: La variable C<$,> ahora puede ser enlazada.

source: \s a whitespace character (space, tab, newline, ...)
es_es: \s un espacio en blanco (espacio, tabulación, nueva línea, ...)

source: one or more of:
es_es: uno o más de:

source: Note that a block by itself is semantically identical to a loop that executes once.
es_es: Note que un bloque por sí mismo es semánticamente idéntico a un bucle que se ejecuta una vez.

source: reset if eof; # clear m??
es_es: reset if eof; # limpiar el estado de m??

source: But a minus sign is not legal with it.
es_es: Sin embargo, un signo menos no es legal con él.

source: @fields = split(/\b(a|b|c)\b/)
es_es: @campos = split(/\b(a|b|c)\b/)

source: Described in L<perldebtut>, L<perldebug> and L<perldebguts>.
es_es: Se describe en L<perldebtut>, L<perldebug> y L<perldebguts>.

source: When searching for single-character delimiters, escaped delimiters and C<\\> are skipped.
es_es: Durante la búsqueda de caracteres delimitadores individuales, los delimitadores escapados y los C<\\> son omitidos.
